Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
extern volatile DMACH5BITS DMACH5bits __attribute__((__sfr__));

#define DMAINT5 DMAINT5
extern volatile unsigned int  DMAINT5 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT5BITS {
  union {
    struct {
      unsigned HALFEN:1;
      unsigned :2;
      unsigned OVRUNIF:1;
      unsigned HALFIF:1;
      unsigned DONEIF:1;
      unsigned LOWIF:1;
      unsigned HIGHIF:1;
      unsigned CHSEL:6;
      unsigned :1;
      unsigned DBUFWF:1;
    };
    struct {
      unsigned :8;
      unsigned CHSEL0:1;
      unsigned CHSEL1:1;
      unsigned CHSEL2:1;
      unsigned CHSEL3:1;
      unsigned CHSEL4:1;
      unsigned CHSEL5:1;
    };
  };
} DMAINT5BITS;
extern volatile DMAINT5BITS DMAINT5bits __attribute__((__sfr__));

#define DMASRC5 DMASRC5
extern volatile unsigned int  DMASRC5 __attribute__((__sfr__));
#define DMADST5 DMADST5
extern volatile unsigned int  DMADST5 __attribute__((__sfr__));
#define DMACNT5 DMACNT5
extern volatile unsigned int  DMACNT5 __attribute__((__sfr__));
#define ADL3CON ADL3CON
extern volatile unsigned long ADL3CON __attribute__((__sfr__));
#define ADL3CONL ADL3CONL
extern volatile unsigned int  ADL3CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL3CONLBITS {
  union {
    struct {
      unsigned SLSIZE:6;
      unsigned :1;
      unsigned THSRC:1;
      unsigned SLTSRC:5;
      unsigned SLENCLR:1;
      unsigned SAMP:1;
      unsigned SLEN:1;
    };
    struct {
      unsigned SLSIZE0:1;
      unsigned SLSIZE1:1;
      unsigned SLSIZE2:1;
      unsigned SLSIZE3:1;
      unsigned SLSIZE4:1;
      unsigned SLSIZE5:1;
      unsigned :2;
      unsigned SLTSRC0:1;
      unsigned SLTSRC1:1;
      unsigned SLTSRC2:1;
      unsigned SLTSRC3:1;
      unsigned SLTSRC4:1;
    };
  };
} ADL3CONLBITS;
extern volatile ADL3CONLBITS ADL3CONLbits __attribute__((__sfr__));

#define ADL3CONH ADL3CONH
extern volatile unsigned int  ADL3CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL3CONHBITS {
  union {
    struct {
      unsigned SAMC:5;
      unsigned MULCHEN:1;
      unsigned PINTRIS:1;
      unsigned CTMEN:1;
      unsigned CM:3;
      unsigned WM:2;
      unsigned SLINT:2;
      unsigned ASEN:1;
    };
    struct {
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
      unsigned :3;
      unsigned CM0:1;
      unsigned CM1:1;
      unsigned CM2:1;
      unsigned WM0:1;
      unsigned WM1:1;
      unsigned SLINT0:1;
      unsigned SLINT1:1;
    };
  };
} ADL3CONHBITS;
extern volatile ADL3CONHBITS ADL3CONHbits __attribute__((__sfr__));

#define ADL3PTR ADL3PTR
extern volatile unsigned int  ADL3PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL3PTRBITS {
  union {
    struct {
      unsigned :8;
      unsigned ADNEXT:7;
    };
    struct {
      unsigned :8;
      unsigned ADNEXT0:1;
      unsigned ADNEXT1:1;
      unsigned ADNEXT2:1;
      unsigned ADNEXT3:1;
      unsigned ADNEXT4:1;
      unsigned ADNEXT5:1;
      unsigned ADNEXT6:1;
    };
  };
} ADL3PTRBITS;
extern volatile ADL3PTRBITS ADL3PTRbits __attribute__((__sfr__));

#define ADL3STAT ADL3STAT
extern volatile unsigned int  ADL3STAT __attribute__((__sfr__));
typedef struct tagADL3STATBITS {
  unsigned :5;
  unsigned ADLIF:1;
  unsigned :1;
  unsigned ADTDLY:1;
  unsigned :6;
  unsigned LBUSY:1;
  unsigned ADTACT:1;
} ADL3STATBITS;
extern volatile ADL3STATBITS ADL3STATbits __attribute__((__sfr__));

#define ADTH3L ADTH3L
extern volatile unsigned int  ADTH3L __attribute__((__sfr__));
typedef struct tagADTH3LBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH3LBITS;
extern volatile ADTH3LBITS ADTH3Lbits __attribute__((__sfr__));

#define ADTH3H ADTH3H
extern volatile unsigned int  ADTH3H __attribute__((__sfr__));
typedef struct tagADTH3HBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH3HBITS;
extern volatile ADTH3HBITS ADTH3Hbits __attribute__((__sfr__));

#define ADL3MSEL ADL3MSEL
extern volatile unsigned long long ADL3MSEL __attribute__((__sfr__));
#define ADL3MSEL0 ADL3MSEL0
extern volatile unsigned int  ADL3MSEL0 __attribute__((__sfr__));
typedef struct tagADL3MSEL0BITS {
  unsigned :15;
  unsigned MSEL15:1;
} ADL3MSEL0BITS;
extern volatile ADL3MSEL0BITS ADL3MSEL0bits __attribute__((__sfr__));

#define ADL3MSEL1 ADL3MSEL1
extern volatile unsigned int  ADL3MSEL1 __attribute__((__sfr__));
typedef struct tagADL3MSEL1BITS {
  unsigned MSEL16:1;
  unsigned MSEL17:1;
  unsigned MSEL18:1;
  unsigned MSEL19:1;
  unsigned MSEL20:1;
  unsigned MSEL21:1;
  unsigned MSEL22:1;
  unsigned MSEL23:1;
  unsigned MSEL24:1;
  unsigned MSEL25:1;
  unsigned MSEL26:1;
  unsigned MSEL27:1;
  unsigned MSEL28:1;
  unsigned MSEL29:1;
  unsigned MSEL30:1;
  unsigned MSEL31:1;
} ADL3MSEL1BITS;
extern volatile ADL3MSEL1BITS ADL3MSEL1bits __attribute__((__sfr__));

#define ADL3MSEL2 ADL3MSEL2
extern volatile unsigned int  ADL3MSEL2 __attribute__((__sfr__));
typedef struct tagADL3MSEL2BITS {
  unsigned MSEL32:1;
  unsigned MSEL33:1;
  unsigned MSEL34:1;
  unsigned MSEL35:1;
  unsigned MSEL36:1;
  unsigned MSEL37:1;
  unsigned MSEL38:1;
  unsigned MSEL39:1;
  unsigned MSEL40:1;
  unsigned MSEL41:1;
  unsigned MSEL42:1;
  unsigned MSEL43:1;
  unsigned MSEL44:1;
  unsigned MSEL45:1;
  unsigned MSEL46:1;
  unsigned MSEL47:1;
} ADL3MSEL2BITS;
extern volatile ADL3MSEL2BITS ADL3MSEL2bits __attribute__((__sfr__));

#define ADL3MSEL3 ADL3MSEL3
extern volatile unsigned int  ADL3MSEL3 __attribute__((__sfr__));
typedef struct tagADL3MSEL3BITS {
  unsigned MSEL48:1;
  unsigned MSEL49:1;
} ADL3MSEL3BITS;
extern volatile ADL3MSEL3BITS ADL3MSEL3bits __attribute__((__sfr__));

#define DAC1CON DAC1CON
extern volatile unsigned int  DAC1CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONBITS {
  union {
    struct {
      unsigned DACREF:2;
      unsigned DACTSEL:5;
      unsigned DACOE:1;
      unsigned DACTRIG:1;
      unsigned :2;
      unsigned DACFM:1;
      unsigned DACSLP:1;
      unsigned DACSIDL:1;
      unsigned :1;
      unsigned DACEN:1;
    };
    struct {
      unsigned REFSEL0:1;
      unsigned REFSEL1:1;
      unsigned DACTSEL0:1;
      unsigned DACTSEL1:1;
      unsigned DACTSEL2:1;
      unsigned DACTSEL3:1;
      unsigned DACTSEL4:1;
    };
  };
} DAC1CONBITS;
extern volatile DAC1CONBITS DAC1CONbits __attribute__((__sfr__));

#define DAC1DAT DAC1DAT
extern volatile unsigned int  DAC1DAT __attribute__((__sfr__));
#define DAC2CON DAC2CON
extern volatile unsigned int  DAC2CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONBITS {
  union {
    struct {
      unsigned DACREF:2;
      unsigned DACTSEL:5;
      unsigned DACOE:1;
      unsigned DACTRIG:1;
      unsigned :2;
      unsigned DACFM:1;
      unsigned DACSLP:1;
      unsigned DACSIDL:1;
      unsigned :1;
      unsigned DACEN:1;
    };
    struct {
      unsigned REFSEL0:1;
      unsigned REFSEL1:1;
      unsigned DACTSEL0:1;
      unsigned DACTSEL1:1;
      unsigned DACTSEL2:1;
      unsigned DACTSEL3:1;
      unsigned DACTSEL4:1;
    };
  };
} DAC2CONBITS;
extern volatile DAC2CONBITS DAC2CONbits __attribute__((__sfr__));

#define DAC2DAT DAC2DAT
extern volatile unsigned int  DAC2DAT __attribute__((__sfr__));
#define U1OTGIR U1OTGIR
extern volatile unsigned int  U1OTGIR __attribute__((__sfr__));
typedef struct tagU1OTGIRBITS {
  unsigned VBUSVDIF:1;
  unsigned :1;
  unsigned SESENDIF:1;
  unsigned SESVDIF:1;
  unsigned ACTVIF:1;
  unsigned LSTATEIF:1;
  unsigned T1MSECIF:1;
  unsigned IDIF:1;
} U1OTGIRBITS;
extern volatile U1OTGIRBITS U1OTGIRbits __attribute__((__sfr__));

#define U1OTGIE U1OTGIE
extern volatile unsigned int  U1OTGIE __attribute__((__sfr__));
typedef struct tagU1OTGIEBITS {
  unsigned VBUSVDIE:1;
  unsigned :1;
  unsigned SESENDIE:1;
  unsigned SESVDIE:1;
  unsigned ACTVIE:1;
  unsigned LSTATEIE:1;
  unsigned T1MSECIE:1;
  unsigned IDIE:1;
} U1OTGIEBITS;
extern volatile U1OTGIEBITS U1OTGIEbits __attribute__((__sfr__));

#define U1OTGSTAT U1OTGSTAT
extern volatile unsigned int  U1OTGSTAT __attribute__((__sfr__));
typedef struct tagU1OTGSTATBITS {
  unsigned VBUSVD:1;
  unsigned :1;
  unsigned SESEND:1;
  unsigned SESVD:1;
  unsigned :1;
  unsigned LSTATE:1;
  unsigned :1;
  unsigned ID:1;
} U1OTGSTATBITS;
