Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
/* SD1CON3 */
#define _SDCH SD1CON3bits.SDCH
#define _SDCS SD1CON3bits.SDCS
#define _SDOSR SD1CON3bits.SDOSR
#define _SDDIV SD1CON3bits.SDDIV
#define _SDCH0 SD1CON3bits.SDCH0
#define _SDCH1 SD1CON3bits.SDCH1
#define _SDCH2 SD1CON3bits.SDCH2
#define _SDCS0 SD1CON3bits.SDCS0
#define _SDCS1 SD1CON3bits.SDCS1
#define _SDOSR0 SD1CON3bits.SDOSR0
#define _SDOSR1 SD1CON3bits.SDOSR1
#define _SDOSR2 SD1CON3bits.SDOSR2
#define _SDDIV0 SD1CON3bits.SDDIV0
#define _SDDIV1 SD1CON3bits.SDDIV1
#define _SDDIV2 SD1CON3bits.SDDIV2

/* ANCFG */
#define _VBG2EN ANCFGbits.VBG2EN

/* ANSB */
#define _ANSB0 ANSBbits.ANSB0
#define _ANSB1 ANSBbits.ANSB1
#define _ANSB2 ANSBbits.ANSB2
#define _ANSB3 ANSBbits.ANSB3
#define _ANSB4 ANSBbits.ANSB4
#define _ANSB5 ANSBbits.ANSB5
#define _ANSB6 ANSBbits.ANSB6
#define _ANSB7 ANSBbits.ANSB7
#define _ANSB12 ANSBbits.ANSB12
#define _ANSB13 ANSBbits.ANSB13
#define _ANSB14 ANSBbits.ANSB14
#define _ANSB15 ANSBbits.ANSB15

/* ANSD */
#define _ANSD0 ANSDbits.ANSD0
#define _ANSD1 ANSDbits.ANSD1
#define _ANSD2 ANSDbits.ANSD2
#define _ANSD3 ANSDbits.ANSD3
#define _ANSD4 ANSDbits.ANSD4
#define _ANSD5 ANSDbits.ANSD5
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSD8 ANSDbits.ANSD8
#define _ANSD9 ANSDbits.ANSD9
#define _ANSD10 ANSDbits.ANSD10
#define _ANSD11 ANSDbits.ANSD11
#define _ANSD12 ANSDbits.ANSD12
#define _ANSD13 ANSDbits.ANSD13
#define _ANSD14 ANSDbits.ANSD14
#define _ANSD15 ANSDbits.ANSD15

/* ANSE */
#define _ANSE4 ANSEbits.ANSE4
#define _ANSE5 ANSEbits.ANSE5
#define _ANSE6 ANSEbits.ANSE6
#define _ANSE7 ANSEbits.ANSE7

/* ANSF */
#define _ANSF0 ANSFbits.ANSF0
#define _ANSF3 ANSFbits.ANSF3
#define _ANSF4 ANSFbits.ANSF4
#define _ANSF5 ANSFbits.ANSF5
#define _ANSF7 ANSFbits.ANSF7

/* ANSG */
#define _ANSG6 ANSGbits.ANSG6
#define _ANSG7 ANSGbits.ANSG7
#define _ANSG8 ANSGbits.ANSG8
#define _ANSG9 ANSGbits.ANSG9

/* ADCON1 */
/* Bitname _PWRLVL cannot be defined because it is used by more than one SFR */
#define _ADCAL ADCON1bits.ADCAL
#define _PUMPEN ADCON1bits.PUMPEN
#define _FORM ADCON1bits.FORM
#define _ADSLP ADCON1bits.ADSLP
#define _ADSIDL ADCON1bits.ADSIDL
#define _ADON ADCON1bits.ADON
#define _FORM0 ADCON1bits.FORM0
#define _FORM1 ADCON1bits.FORM1
#define _FORM2 ADCON1bits.FORM2
#define _FORM3 ADCON1bits.FORM3

/* ADCON2 */
#define _ADHALT ADCON2bits.ADHALT
#define _REFPUMP ADCON2bits.REFPUMP
#define _BUFINT ADCON2bits.BUFINT
#define _ADPWR ADCON2bits.ADPWR
#define _BUFORG ADCON2bits.BUFORG
#define _NVCFG0 ADCON2bits.NVCFG0
#define _PVCFG ADCON2bits.PVCFG
#define _BUFINT0 ADCON2bits.BUFINT0
#define _BUFINT1 ADCON2bits.BUFINT1
#define _ADPWR0 ADCON2bits.ADPWR0
#define _ADPWR1 ADCON2bits.ADPWR1
#define _NVCFG ADCON2bits.NVCFG
#define _PVCFG0 ADCON2bits.PVCFG0
#define _PVCFG1 ADCON2bits.PVCFG1
#define _RFPUMP ADCON2bits.RFPUMP

/* ADCON3 */
#define _ADCS ADCON3bits.ADCS
#define _ADRC ADCON3bits.ADRC
#define _ADCS0 ADCON3bits.ADCS0
#define _ADCS1 ADCON3bits.ADCS1
#define _ADCS2 ADCON3bits.ADCS2
#define _ADCS3 ADCON3bits.ADCS3
#define _ADCS4 ADCON3bits.ADCS4
#define _ADCS5 ADCON3bits.ADCS5
#define _ADCS6 ADCON3bits.ADCS6
#define _ADCS7 ADCON3bits.ADCS7
/* Bitname _SLEN cannot be defined because it is used by more than one SFR */
#define _SLEN0 ADCON3bits.SLEN0
#define _SLEN1 ADCON3bits.SLEN1
#define _SLEN2 ADCON3bits.SLEN2
#define _SLEN3 ADCON3bits.SLEN3

/* ADSTATL */
#define _SL0IF ADSTATLbits.SL0IF
#define _SL1IF ADSTATLbits.SL1IF
#define _SL2IF ADSTATLbits.SL2IF
#define _SL3IF ADSTATLbits.SL3IF
#define _ACCIF ADSTATLbits.ACCIF
#define _BUFIF ADSTATLbits.BUFIF
#define _SLERR ADSTATLbits.SLERR
#define _SLERR0 ADSTATLbits.SLERR0
#define _SLERR1 ADSTATLbits.SLERR1
#define _SLERR2 ADSTATLbits.SLERR2
#define _SLERR3 ADSTATLbits.SLERR3
#define _SLOV ADSTATLbits.SLOV

/* ADSTATH */
#define _ADBUSY ADSTATHbits.ADBUSY
#define _ADREADY ADSTATHbits.ADREADY
#define _PUMPST ADSTATHbits.PUMPST

/* ACCONL */
#define _COUNT ACCONLbits.COUNT
#define _TBLSEL ACCONLbits.TBLSEL
#define _COUNT0 ACCONLbits.COUNT0
#define _COUNT1 ACCONLbits.COUNT1
#define _COUNT2 ACCONLbits.COUNT2
#define _COUNT3 ACCONLbits.COUNT3
#define _COUNT4 ACCONLbits.COUNT4
#define _COUNT5 ACCONLbits.COUNT5
#define _COUNT6 ACCONLbits.COUNT6
#define _COUNT7 ACCONLbits.COUNT7
#define _TBLSEL0 ACCONLbits.TBLSEL0
#define _TBLSEL1 ACCONLbits.TBLSEL1
#define _TBLSEL2 ACCONLbits.TBLSEL2
#define _TBLSEL3 ACCONLbits.TBLSEL3
#define _TBLSEL4 ACCONLbits.TBLSEL4
#define _TBLSEL5 ACCONLbits.TBLSEL5

/* ACCONH */
#define _ACIE ACCONHbits.ACIE
#define _ACEN ACCONHbits.ACEN

/* ADCHITL */
#define _CHH0 ADCHITLbits.CHH0
#define _CHH1 ADCHITLbits.CHH1
#define _CHH2 ADCHITLbits.CHH2
#define _CHH3 ADCHITLbits.CHH3
#define _CHH4 ADCHITLbits.CHH4
#define _CHH5 ADCHITLbits.CHH5
#define _CHH6 ADCHITLbits.CHH6
#define _CHH7 ADCHITLbits.CHH7
#define _CHH8 ADCHITLbits.CHH8
#define _CHH9 ADCHITLbits.CHH9
#define _CHH10 ADCHITLbits.CHH10
#define _CHH11 ADCHITLbits.CHH11
#define _CHH12 ADCHITLbits.CHH12
#define _CHH13 ADCHITLbits.CHH13
#define _CHH14 ADCHITLbits.CHH14
#define _CHH15 ADCHITLbits.CHH15

/* ADCHITH */
#define _CHH16 ADCHITHbits.CHH16
#define _CHH17 ADCHITHbits.CHH17
#define _CHH18 ADCHITHbits.CHH18
#define _CHH19 ADCHITHbits.CHH19
#define _CHH20 ADCHITHbits.CHH20
#define _CHH21 ADCHITHbits.CHH21
#define _CHH22 ADCHITHbits.CHH22
#define _CHH23 ADCHITHbits.CHH23
#define _CHH24 ADCHITHbits.CHH24
#define _CHH25 ADCHITHbits.CHH25
#define _CHH26 ADCHITHbits.CHH26
#define _CHH27 ADCHITHbits.CHH27
#define _CHH28 ADCHITHbits.CHH28
#define _CHH29 ADCHITHbits.CHH29
#define _CHH30 ADCHITHbits.CHH30
#define _CHH31 ADCHITHbits.CHH31

/* ADL0CONL */
/* Bitname _SLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _THSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SLENCLR cannot be defined because it is used by more than one SFR */
/* Bitname _SAMP cannot be defined because it is used by more than one SFR */
/* Bitname _SLEN cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _SLSIZE5 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLTSRC4 cannot be defined because it is used by more than one SFR */

/* ADL0CONH */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _MULCHEN cannot be defined because it is used by more than one SFR */
/* Bitname _PINTRIS cannot be defined because it is used by more than one SFR */
/* Bitname _CTMEN cannot be defined because it is used by more than one SFR */
/* Bitname _CM cannot be defined because it is used by more than one SFR */
/* Bitname _WM cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEN cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _CM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CM2 cannot be defined because it is used by more than one SFR */
/* Bitname _WM0 cannot be defined because it is used by more than one SFR */
/* Bitname _WM1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT1 cannot be defined because it is used by more than one SFR */

/* ADL0PTR */
/* Bitname _ADNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT6 cannot be defined because it is used by more than one SFR */

/* ADL0STAT */
/* Bitname _ADLIF cannot be defined because it is used by more than one SFR */
/* Bitname _ADTDLY cannot be defined because it is used by more than one SFR */
/* Bitname _LBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _ADTACT cannot be defined because it is used by more than one SFR */

/* ADTH0L */
/* Bitname _TH0 cannot be defined because it is used by more than one SFR */
/* Bitname _TH1 cannot be defined because it is used by more than one SFR */
/* Bitname _TH2 cannot be defined because it is used by more than one SFR */
/* Bitname _TH3 cannot be defined because it is used by more than one SFR */
/* Bitname _TH4 cannot be defined because it is used by more than one SFR */
/* Bitname _TH5 cannot be defined because it is used by more than one SFR */
/* Bitname _TH6 cannot be defined because it is used by more than one SFR */
/* Bitname _TH7 cannot be defined because it is used by more than one SFR */
/* Bitname _TH8 cannot be defined because it is used by more than one SFR */
/* Bitname _TH9 cannot be defined because it is used by more than one SFR */
/* Bitname _TH10 cannot be defined because it is used by more than one SFR */
/* Bitname _TH11 cannot be defined because it is used by more than one SFR */
/* Bitname _TH12 cannot be defined because it is used by more than one SFR */
/* Bitname _TH13 cannot be defined because it is used by more than one SFR */
/* Bitname _TH14 cannot be defined because it is used by more than one SFR */
/* Bitname _TH15 cannot be defined because it is used by more than one SFR */

/* ADTH0H */
/* Bitname _TH0 cannot be defined because it is used by more than one SFR */
/* Bitname _TH1 cannot be defined because it is used by more than one SFR */
/* Bitname _TH2 cannot be defined because it is used by more than one SFR */
/* Bitname _TH3 cannot be defined because it is used by more than one SFR */
/* Bitname _TH4 cannot be defined because it is used by more than one SFR */
/* Bitname _TH5 cannot be defined because it is used by more than one SFR */
/* Bitname _TH6 cannot be defined because it is used by more than one SFR */
/* Bitname _TH7 cannot be defined because it is used by more than one SFR */
/* Bitname _TH8 cannot be defined because it is used by more than one SFR */
/* Bitname _TH9 cannot be defined because it is used by more than one SFR */
/* Bitname _TH10 cannot be defined because it is used by more than one SFR */
/* Bitname _TH11 cannot be defined because it is used by more than one SFR */
/* Bitname _TH12 cannot be defined because it is used by more than one SFR */
/* Bitname _TH13 cannot be defined because it is used by more than one SFR */
/* Bitname _TH14 cannot be defined because it is used by more than one SFR */
/* Bitname _TH15 cannot be defined because it is used by more than one SFR */

/* ADL0MSEL0 */
/* Bitname _MSEL15 cannot be defined because it is used by more than one SFR */

