Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
#define _IPC21_U4ERIP_POSITION                   0x0000000C
#define _IPC21_U4ERIP_MASK                       0x00007000
#define _IPC21_U4ERIP_LENGTH                     0x00000003

#define _IPC21_USB1IP0_POSITION                  0x00000008
#define _IPC21_USB1IP0_MASK                      0x00000100
#define _IPC21_USB1IP0_LENGTH                    0x00000001

#define _IPC21_USB1IP1_POSITION                  0x00000009
#define _IPC21_USB1IP1_MASK                      0x00000200
#define _IPC21_USB1IP1_LENGTH                    0x00000001

#define _IPC21_USB1IP2_POSITION                  0x0000000A
#define _IPC21_USB1IP2_MASK                      0x00000400
#define _IPC21_USB1IP2_LENGTH                    0x00000001

#define _IPC21_U4ERIP0_POSITION                  0x0000000C
#define _IPC21_U4ERIP0_MASK                      0x00001000
#define _IPC21_U4ERIP0_LENGTH                    0x00000001

#define _IPC21_U4ERIP1_POSITION                  0x0000000D
#define _IPC21_U4ERIP1_MASK                      0x00002000
#define _IPC21_U4ERIP1_LENGTH                    0x00000001

#define _IPC21_U4ERIP2_POSITION                  0x0000000E
#define _IPC21_U4ERIP2_MASK                      0x00004000
#define _IPC21_U4ERIP2_LENGTH                    0x00000001

#define _IPC22_U4RXIP_POSITION                   0x00000000
#define _IPC22_U4RXIP_MASK                       0x00000007
#define _IPC22_U4RXIP_LENGTH                     0x00000003

#define _IPC22_U4TXIP_POSITION                   0x00000004
#define _IPC22_U4TXIP_MASK                       0x00000070
#define _IPC22_U4TXIP_LENGTH                     0x00000003

#define _IPC22_U4RXIP0_POSITION                  0x00000000
#define _IPC22_U4RXIP0_MASK                      0x00000001
#define _IPC22_U4RXIP0_LENGTH                    0x00000001

#define _IPC22_U4RXIP1_POSITION                  0x00000001
#define _IPC22_U4RXIP1_MASK                      0x00000002
#define _IPC22_U4RXIP1_LENGTH                    0x00000001

#define _IPC22_U4RXIP2_POSITION                  0x00000002
#define _IPC22_U4RXIP2_MASK                      0x00000004
#define _IPC22_U4RXIP2_LENGTH                    0x00000001

#define _IPC22_U4TXIP0_POSITION                  0x00000004
#define _IPC22_U4TXIP0_MASK                      0x00000010
#define _IPC22_U4TXIP0_LENGTH                    0x00000001

#define _IPC22_U4TXIP1_POSITION                  0x00000005
#define _IPC22_U4TXIP1_MASK                      0x00000020
#define _IPC22_U4TXIP1_LENGTH                    0x00000001

#define _IPC22_U4TXIP2_POSITION                  0x00000006
#define _IPC22_U4TXIP2_MASK                      0x00000040
#define _IPC22_U4TXIP2_LENGTH                    0x00000001

#define _IPC23_OC9IP_POSITION                    0x00000000
#define _IPC23_OC9IP_MASK                        0x00000007
#define _IPC23_OC9IP_LENGTH                      0x00000003

#define _IPC23_IC9IP_POSITION                    0x00000004
#define _IPC23_IC9IP_MASK                        0x00000070
#define _IPC23_IC9IP_LENGTH                      0x00000003

#define _IPC23_OC9IP0_POSITION                   0x00000000
#define _IPC23_OC9IP0_MASK                       0x00000001
#define _IPC23_OC9IP0_LENGTH                     0x00000001

#define _IPC23_OC9IP1_POSITION                   0x00000001
#define _IPC23_OC9IP1_MASK                       0x00000002
#define _IPC23_OC9IP1_LENGTH                     0x00000001

#define _IPC23_OC9IP2_POSITION                   0x00000002
#define _IPC23_OC9IP2_MASK                       0x00000004
#define _IPC23_OC9IP2_LENGTH                     0x00000001

#define _IPC23_IC9IP0_POSITION                   0x00000004
#define _IPC23_IC9IP0_MASK                       0x00000010
#define _IPC23_IC9IP0_LENGTH                     0x00000001

#define _IPC23_IC9IP1_POSITION                   0x00000005
#define _IPC23_IC9IP1_MASK                       0x00000020
#define _IPC23_IC9IP1_LENGTH                     0x00000001

#define _IPC23_IC9IP2_POSITION                   0x00000006
#define _IPC23_IC9IP2_MASK                       0x00000040
#define _IPC23_IC9IP2_LENGTH                     0x00000001

#define _IPC25_LCDIP_POSITION                    0x00000000
#define _IPC25_LCDIP_MASK                        0x00000007
#define _IPC25_LCDIP_LENGTH                      0x00000003

#define _IPC25_AMP1IP_POSITION                   0x0000000C
#define _IPC25_AMP1IP_MASK                       0x00007000
#define _IPC25_AMP1IP_LENGTH                     0x00000003

#define _IPC25_LCDIP0_POSITION                   0x00000000
#define _IPC25_LCDIP0_MASK                       0x00000001
#define _IPC25_LCDIP0_LENGTH                     0x00000001

#define _IPC25_LCDIP1_POSITION                   0x00000001
#define _IPC25_LCDIP1_MASK                       0x00000002
#define _IPC25_LCDIP1_LENGTH                     0x00000001

#define _IPC25_LCDIP2_POSITION                   0x00000002
#define _IPC25_LCDIP2_MASK                       0x00000004
#define _IPC25_LCDIP2_LENGTH                     0x00000001

#define _IPC25_AMP1IP0_POSITION                  0x0000000C
#define _IPC25_AMP1IP0_MASK                      0x00001000
#define _IPC25_AMP1IP0_LENGTH                    0x00000001

#define _IPC25_AMP1IP1_POSITION                  0x0000000D
#define _IPC25_AMP1IP1_MASK                      0x00002000
#define _IPC25_AMP1IP1_LENGTH                    0x00000001

#define _IPC25_AMP1IP2_POSITION                  0x0000000E
#define _IPC25_AMP1IP2_MASK                      0x00004000
#define _IPC25_AMP1IP2_LENGTH                    0x00000001

#define _IPC26_AMP2IP_POSITION                   0x00000000
#define _IPC26_AMP2IP_MASK                       0x00000007
#define _IPC26_AMP2IP_LENGTH                     0x00000003

#define _IPC26_SDA1IP_POSITION                   0x00000004
#define _IPC26_SDA1IP_MASK                       0x00000070
#define _IPC26_SDA1IP_LENGTH                     0x00000003

#define _IPC26_FSTIP_POSITION                    0x00000008
#define _IPC26_FSTIP_MASK                        0x00000700
#define _IPC26_FSTIP_LENGTH                      0x00000003

#define _IPC26_AMP2IP0_POSITION                  0x00000000
#define _IPC26_AMP2IP0_MASK                      0x00000001
#define _IPC26_AMP2IP0_LENGTH                    0x00000001

#define _IPC26_AMP2IP1_POSITION                  0x00000001
#define _IPC26_AMP2IP1_MASK                      0x00000002
#define _IPC26_AMP2IP1_LENGTH                    0x00000001

