Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
#define _ADTBL30_ADCH6_POSITION                  0x00000006
#define _ADTBL30_ADCH6_MASK                      0x00000040
#define _ADTBL30_ADCH6_LENGTH                    0x00000001

#define _ADTBL31_ADCH_POSITION                   0x00000000
#define _ADTBL31_ADCH_MASK                       0x0000007F
#define _ADTBL31_ADCH_LENGTH                     0x00000007

#define _ADTBL31_DIFF_POSITION                   0x0000000E
#define _ADTBL31_DIFF_MASK                       0x00004000
#define _ADTBL31_DIFF_LENGTH                     0x00000001

#define _ADTBL31_UCTMU_POSITION                  0x0000000F
#define _ADTBL31_UCTMU_MASK                      0x00008000
#define _ADTBL31_UCTMU_LENGTH                    0x00000001

#define _ADTBL31_ADCH0_POSITION                  0x00000000
#define _ADTBL31_ADCH0_MASK                      0x00000001
#define _ADTBL31_ADCH0_LENGTH                    0x00000001

#define _ADTBL31_ADCH1_POSITION                  0x00000001
#define _ADTBL31_ADCH1_MASK                      0x00000002
#define _ADTBL31_ADCH1_LENGTH                    0x00000001

#define _ADTBL31_ADCH2_POSITION                  0x00000002
#define _ADTBL31_ADCH2_MASK                      0x00000004
#define _ADTBL31_ADCH2_LENGTH                    0x00000001

#define _ADTBL31_ADCH3_POSITION                  0x00000003
#define _ADTBL31_ADCH3_MASK                      0x00000008
#define _ADTBL31_ADCH3_LENGTH                    0x00000001

#define _ADTBL31_ADCH4_POSITION                  0x00000004
#define _ADTBL31_ADCH4_MASK                      0x00000010
#define _ADTBL31_ADCH4_LENGTH                    0x00000001

#define _ADTBL31_ADCH5_POSITION                  0x00000005
#define _ADTBL31_ADCH5_MASK                      0x00000020
#define _ADTBL31_ADCH5_LENGTH                    0x00000001

#define _ADTBL31_ADCH6_POSITION                  0x00000006
#define _ADTBL31_ADCH6_MASK                      0x00000040
#define _ADTBL31_ADCH6_LENGTH                    0x00000001

#define _DMACON_PRSSEL_POSITION                  0x00000000
#define _DMACON_PRSSEL_MASK                      0x00000001
#define _DMACON_PRSSEL_LENGTH                    0x00000001

#define _DMACON_DMASIDL_POSITION                 0x0000000D
#define _DMACON_DMASIDL_MASK                     0x00002000
#define _DMACON_DMASIDL_LENGTH                   0x00000001

#define _DMACON_DMAEN_POSITION                   0x0000000F
#define _DMACON_DMAEN_MASK                       0x00008000
#define _DMACON_DMAEN_LENGTH                     0x00000001

#define _DMACH0_CHEN_POSITION                    0x00000000
#define _DMACH0_CHEN_MASK                        0x00000001
#define _DMACH0_CHEN_LENGTH                      0x00000001

#define _DMACH0_SIZE_POSITION                    0x00000001
#define _DMACH0_SIZE_MASK                        0x00000002
#define _DMACH0_SIZE_LENGTH                      0x00000001

#define _DMACH0_TRMODE_POSITION                  0x00000002
#define _DMACH0_TRMODE_MASK                      0x0000000C
#define _DMACH0_TRMODE_LENGTH                    0x00000002

#define _DMACH0_DAMODE_POSITION                  0x00000004
#define _DMACH0_DAMODE_MASK                      0x00000030
#define _DMACH0_DAMODE_LENGTH                    0x00000002

#define _DMACH0_SAMODE_POSITION                  0x00000006
#define _DMACH0_SAMODE_MASK                      0x000000C0
#define _DMACH0_SAMODE_LENGTH                    0x00000002

#define _DMACH0_CHREQ_POSITION                   0x00000008
#define _DMACH0_CHREQ_MASK                       0x00000100
#define _DMACH0_CHREQ_LENGTH                     0x00000001

#define _DMACH0_RELOAD_POSITION                  0x00000009
#define _DMACH0_RELOAD_MASK                      0x00000200
#define _DMACH0_RELOAD_LENGTH                    0x00000001

#define _DMACH0_NULLW_POSITION                   0x0000000A
#define _DMACH0_NULLW_MASK                       0x00000400
#define _DMACH0_NULLW_LENGTH                     0x00000001

#define _DMACH0_TRMODE0_POSITION                 0x00000002
#define _DMACH0_TRMODE0_MASK                     0x00000004
#define _DMACH0_TRMODE0_LENGTH                   0x00000001

#define _DMACH0_TRMODE1_POSITION                 0x00000003
#define _DMACH0_TRMODE1_MASK                     0x00000008
#define _DMACH0_TRMODE1_LENGTH                   0x00000001

#define _DMACH0_DAMODE0_POSITION                 0x00000004
#define _DMACH0_DAMODE0_MASK                     0x00000010
#define _DMACH0_DAMODE0_LENGTH                   0x00000001

#define _DMACH0_DAMODE1_POSITION                 0x00000005
#define _DMACH0_DAMODE1_MASK                     0x00000020
#define _DMACH0_DAMODE1_LENGTH                   0x00000001

#define _DMACH0_SAMODE0_POSITION                 0x00000006
#define _DMACH0_SAMODE0_MASK                     0x00000040
#define _DMACH0_SAMODE0_LENGTH                   0x00000001

#define _DMACH0_SAMODE1_POSITION                 0x00000007
#define _DMACH0_SAMODE1_MASK                     0x00000080
#define _DMACH0_SAMODE1_LENGTH                   0x00000001

#define _DMAINT0_HALFEN_POSITION                 0x00000000
#define _DMAINT0_HALFEN_MASK                     0x00000001
#define _DMAINT0_HALFEN_LENGTH                   0x00000001

#define _DMAINT0_OVRUNIF_POSITION                0x00000003
#define _DMAINT0_OVRUNIF_MASK                    0x00000008
#define _DMAINT0_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT0_HALFIF_POSITION                 0x00000004
#define _DMAINT0_HALFIF_MASK                     0x00000010
#define _DMAINT0_HALFIF_LENGTH                   0x00000001

#define _DMAINT0_DONEIF_POSITION                 0x00000005
#define _DMAINT0_DONEIF_MASK                     0x00000020
#define _DMAINT0_DONEIF_LENGTH                   0x00000001

#define _DMAINT0_LOWIF_POSITION                  0x00000006
#define _DMAINT0_LOWIF_MASK                      0x00000040
#define _DMAINT0_LOWIF_LENGTH                    0x00000001

#define _DMAINT0_HIGHIF_POSITION                 0x00000007
#define _DMAINT0_HIGHIF_MASK                     0x00000080
#define _DMAINT0_HIGHIF_LENGTH                   0x00000001

#define _DMAINT0_CHSEL_POSITION                  0x00000008
#define _DMAINT0_CHSEL_MASK                      0x00003F00
#define _DMAINT0_CHSEL_LENGTH                    0x00000006

#define _DMAINT0_DBUFWF_POSITION                 0x0000000F
#define _DMAINT0_DBUFWF_MASK                     0x00008000
#define _DMAINT0_DBUFWF_LENGTH                   0x00000001

#define _DMAINT0_CHSEL0_POSITION                 0x00000008
#define _DMAINT0_CHSEL0_MASK                     0x00000100
#define _DMAINT0_CHSEL0_LENGTH                   0x00000001

#define _DMAINT0_CHSEL1_POSITION                 0x00000009
#define _DMAINT0_CHSEL1_MASK                     0x00000200
#define _DMAINT0_CHSEL1_LENGTH                   0x00000001

#define _DMAINT0_CHSEL2_POSITION                 0x0000000A
#define _DMAINT0_CHSEL2_MASK                     0x00000400
#define _DMAINT0_CHSEL2_LENGTH                   0x00000001

