Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
#define _ADL3CONL_SLENCLR_POSITION               0x0000000D
#define _ADL3CONL_SLENCLR_MASK                   0x00002000
#define _ADL3CONL_SLENCLR_LENGTH                 0x00000001

#define _ADL3CONL_SAMP_POSITION                  0x0000000E
#define _ADL3CONL_SAMP_MASK                      0x00004000
#define _ADL3CONL_SAMP_LENGTH                    0x00000001

#define _ADL3CONL_SLEN_POSITION                  0x0000000F
#define _ADL3CONL_SLEN_MASK                      0x00008000
#define _ADL3CONL_SLEN_LENGTH                    0x00000001

#define _ADL3CONL_SLSIZE0_POSITION               0x00000000
#define _ADL3CONL_SLSIZE0_MASK                   0x00000001
#define _ADL3CONL_SLSIZE0_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE1_POSITION               0x00000001
#define _ADL3CONL_SLSIZE1_MASK                   0x00000002
#define _ADL3CONL_SLSIZE1_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE2_POSITION               0x00000002
#define _ADL3CONL_SLSIZE2_MASK                   0x00000004
#define _ADL3CONL_SLSIZE2_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE3_POSITION               0x00000003
#define _ADL3CONL_SLSIZE3_MASK                   0x00000008
#define _ADL3CONL_SLSIZE3_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE4_POSITION               0x00000004
#define _ADL3CONL_SLSIZE4_MASK                   0x00000010
#define _ADL3CONL_SLSIZE4_LENGTH                 0x00000001

#define _ADL3CONL_SLSIZE5_POSITION               0x00000005
#define _ADL3CONL_SLSIZE5_MASK                   0x00000020
#define _ADL3CONL_SLSIZE5_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC0_POSITION               0x00000008
#define _ADL3CONL_SLTSRC0_MASK                   0x00000100
#define _ADL3CONL_SLTSRC0_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC1_POSITION               0x00000009
#define _ADL3CONL_SLTSRC1_MASK                   0x00000200
#define _ADL3CONL_SLTSRC1_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC2_POSITION               0x0000000A
#define _ADL3CONL_SLTSRC2_MASK                   0x00000400
#define _ADL3CONL_SLTSRC2_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC3_POSITION               0x0000000B
#define _ADL3CONL_SLTSRC3_MASK                   0x00000800
#define _ADL3CONL_SLTSRC3_LENGTH                 0x00000001

#define _ADL3CONL_SLTSRC4_POSITION               0x0000000C
#define _ADL3CONL_SLTSRC4_MASK                   0x00001000
#define _ADL3CONL_SLTSRC4_LENGTH                 0x00000001

#define _ADL3CONH_SAMC_POSITION                  0x00000000
#define _ADL3CONH_SAMC_MASK                      0x0000001F
#define _ADL3CONH_SAMC_LENGTH                    0x00000005

#define _ADL3CONH_MULCHEN_POSITION               0x00000005
#define _ADL3CONH_MULCHEN_MASK                   0x00000020
#define _ADL3CONH_MULCHEN_LENGTH                 0x00000001

#define _ADL3CONH_PINTRIS_POSITION               0x00000006
#define _ADL3CONH_PINTRIS_MASK                   0x00000040
#define _ADL3CONH_PINTRIS_LENGTH                 0x00000001

#define _ADL3CONH_CTMEN_POSITION                 0x00000007
#define _ADL3CONH_CTMEN_MASK                     0x00000080
#define _ADL3CONH_CTMEN_LENGTH                   0x00000001

#define _ADL3CONH_CM_POSITION                    0x00000008
#define _ADL3CONH_CM_MASK                        0x00000700
#define _ADL3CONH_CM_LENGTH                      0x00000003

#define _ADL3CONH_WM_POSITION                    0x0000000B
#define _ADL3CONH_WM_MASK                        0x00001800
#define _ADL3CONH_WM_LENGTH                      0x00000002

#define _ADL3CONH_SLINT_POSITION                 0x0000000D
#define _ADL3CONH_SLINT_MASK                     0x00006000
#define _ADL3CONH_SLINT_LENGTH                   0x00000002

#define _ADL3CONH_ASEN_POSITION                  0x0000000F
#define _ADL3CONH_ASEN_MASK                      0x00008000
#define _ADL3CONH_ASEN_LENGTH                    0x00000001

#define _ADL3CONH_SAMC0_POSITION                 0x00000000
#define _ADL3CONH_SAMC0_MASK                     0x00000001
#define _ADL3CONH_SAMC0_LENGTH                   0x00000001

#define _ADL3CONH_SAMC1_POSITION                 0x00000001
#define _ADL3CONH_SAMC1_MASK                     0x00000002
#define _ADL3CONH_SAMC1_LENGTH                   0x00000001

#define _ADL3CONH_SAMC2_POSITION                 0x00000002
#define _ADL3CONH_SAMC2_MASK                     0x00000004
#define _ADL3CONH_SAMC2_LENGTH                   0x00000001

#define _ADL3CONH_SAMC3_POSITION                 0x00000003
#define _ADL3CONH_SAMC3_MASK                     0x00000008
#define _ADL3CONH_SAMC3_LENGTH                   0x00000001

#define _ADL3CONH_SAMC4_POSITION                 0x00000004
#define _ADL3CONH_SAMC4_MASK                     0x00000010
#define _ADL3CONH_SAMC4_LENGTH                   0x00000001

#define _ADL3CONH_CM0_POSITION                   0x00000008
#define _ADL3CONH_CM0_MASK                       0x00000100
#define _ADL3CONH_CM0_LENGTH                     0x00000001

#define _ADL3CONH_CM1_POSITION                   0x00000009
#define _ADL3CONH_CM1_MASK                       0x00000200
#define _ADL3CONH_CM1_LENGTH                     0x00000001

#define _ADL3CONH_CM2_POSITION                   0x0000000A
#define _ADL3CONH_CM2_MASK                       0x00000400
#define _ADL3CONH_CM2_LENGTH                     0x00000001

#define _ADL3CONH_WM0_POSITION                   0x0000000B
#define _ADL3CONH_WM0_MASK                       0x00000800
#define _ADL3CONH_WM0_LENGTH                     0x00000001

#define _ADL3CONH_WM1_POSITION                   0x0000000C
#define _ADL3CONH_WM1_MASK                       0x00001000
#define _ADL3CONH_WM1_LENGTH                     0x00000001

#define _ADL3CONH_SLINT0_POSITION                0x0000000D
#define _ADL3CONH_SLINT0_MASK                    0x00002000
#define _ADL3CONH_SLINT0_LENGTH                  0x00000001

#define _ADL3CONH_SLINT1_POSITION                0x0000000E
#define _ADL3CONH_SLINT1_MASK                    0x00004000
#define _ADL3CONH_SLINT1_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT_POSITION                 0x00000008
#define _ADL3PTR_ADNEXT_MASK                     0x00007F00
#define _ADL3PTR_ADNEXT_LENGTH                   0x00000007

#define _ADL3PTR_ADNEXT0_POSITION                0x00000008
#define _ADL3PTR_ADNEXT0_MASK                    0x00000100
#define _ADL3PTR_ADNEXT0_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT1_POSITION                0x00000009
#define _ADL3PTR_ADNEXT1_MASK                    0x00000200
#define _ADL3PTR_ADNEXT1_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT2_POSITION                0x0000000A
#define _ADL3PTR_ADNEXT2_MASK                    0x00000400
#define _ADL3PTR_ADNEXT2_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT3_POSITION                0x0000000B
#define _ADL3PTR_ADNEXT3_MASK                    0x00000800
#define _ADL3PTR_ADNEXT3_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT4_POSITION                0x0000000C
#define _ADL3PTR_ADNEXT4_MASK                    0x00001000
#define _ADL3PTR_ADNEXT4_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT5_POSITION                0x0000000D
#define _ADL3PTR_ADNEXT5_MASK                    0x00002000
#define _ADL3PTR_ADNEXT5_LENGTH                  0x00000001

#define _ADL3PTR_ADNEXT6_POSITION                0x0000000E
#define _ADL3PTR_ADNEXT6_MASK                    0x00004000
#define _ADL3PTR_ADNEXT6_LENGTH                  0x00000001

#define _ADL3STAT_ADLIF_POSITION                 0x00000005
#define _ADL3STAT_ADLIF_MASK                     0x00000020
#define _ADL3STAT_ADLIF_LENGTH                   0x00000001

#define _ADL3STAT_ADTDLY_POSITION                0x00000007
#define _ADL3STAT_ADTDLY_MASK                    0x00000080
#define _ADL3STAT_ADTDLY_LENGTH                  0x00000001

#define _ADL3STAT_LBUSY_POSITION                 0x0000000E
#define _ADL3STAT_LBUSY_MASK                     0x00004000
#define _ADL3STAT_LBUSY_LENGTH                   0x00000001

#define _ADL3STAT_ADTACT_POSITION                0x0000000F
#define _ADL3STAT_ADTACT_MASK                    0x00008000
#define _ADL3STAT_ADTACT_LENGTH                  0x00000001

#define _ADTH3L_TH0_POSITION                     0x00000000
#define _ADTH3L_TH0_MASK                         0x00000001
#define _ADTH3L_TH0_LENGTH                       0x00000001

#define _ADTH3L_TH1_POSITION                     0x00000001
#define _ADTH3L_TH1_MASK                         0x00000002
#define _ADTH3L_TH1_LENGTH                       0x00000001

#define _ADTH3L_TH2_POSITION                     0x00000002
#define _ADTH3L_TH2_MASK                         0x00000004
#define _ADTH3L_TH2_LENGTH                       0x00000001

#define _ADTH3L_TH3_POSITION                     0x00000003
#define _ADTH3L_TH3_MASK                         0x00000008
#define _ADTH3L_TH3_LENGTH                       0x00000001

#define _ADTH3L_TH4_POSITION                     0x00000004
#define _ADTH3L_TH4_MASK                         0x00000010
#define _ADTH3L_TH4_LENGTH                       0x00000001

#define _ADTH3L_TH5_POSITION                     0x00000005
#define _ADTH3L_TH5_MASK                         0x00000020
#define _ADTH3L_TH5_LENGTH                       0x00000001

#define _ADTH3L_TH6_POSITION                     0x00000006
#define _ADTH3L_TH6_MASK                         0x00000040
#define _ADTH3L_TH6_LENGTH                       0x00000001

#define _ADTH3L_TH7_POSITION                     0x00000007
#define _ADTH3L_TH7_MASK                         0x00000080
#define _ADTH3L_TH7_LENGTH                       0x00000001

