Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
#define _ANSE_ANSE7_POSITION                     0x00000007
#define _ANSE_ANSE7_MASK                         0x00000080
#define _ANSE_ANSE7_LENGTH                       0x00000001

#define _ANSF_ANSF0_POSITION                     0x00000000
#define _ANSF_ANSF0_MASK                         0x00000001
#define _ANSF_ANSF0_LENGTH                       0x00000001

#define _ANSF_ANSF3_POSITION                     0x00000003
#define _ANSF_ANSF3_MASK                         0x00000008
#define _ANSF_ANSF3_LENGTH                       0x00000001

#define _ANSF_ANSF4_POSITION                     0x00000004
#define _ANSF_ANSF4_MASK                         0x00000010
#define _ANSF_ANSF4_LENGTH                       0x00000001

#define _ANSF_ANSF5_POSITION                     0x00000005
#define _ANSF_ANSF5_MASK                         0x00000020
#define _ANSF_ANSF5_LENGTH                       0x00000001

#define _ANSF_ANSF7_POSITION                     0x00000007
#define _ANSF_ANSF7_MASK                         0x00000080
#define _ANSF_ANSF7_LENGTH                       0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ADCON1_PWRLVL_POSITION                  0x00000000
#define _ADCON1_PWRLVL_MASK                      0x00000001
#define _ADCON1_PWRLVL_LENGTH                    0x00000001

#define _ADCON1_ADCAL_POSITION                   0x00000006
#define _ADCON1_ADCAL_MASK                       0x00000040
#define _ADCON1_ADCAL_LENGTH                     0x00000001

#define _ADCON1_PUMPEN_POSITION                  0x00000007
#define _ADCON1_PUMPEN_MASK                      0x00000080
#define _ADCON1_PUMPEN_LENGTH                    0x00000001

#define _ADCON1_FORM_POSITION                    0x00000008
#define _ADCON1_FORM_MASK                        0x00000F00
#define _ADCON1_FORM_LENGTH                      0x00000004

#define _ADCON1_ADSLP_POSITION                   0x0000000C
#define _ADCON1_ADSLP_MASK                       0x00001000
#define _ADCON1_ADSLP_LENGTH                     0x00000001

#define _ADCON1_ADSIDL_POSITION                  0x0000000D
#define _ADCON1_ADSIDL_MASK                      0x00002000
#define _ADCON1_ADSIDL_LENGTH                    0x00000001

#define _ADCON1_ADON_POSITION                    0x0000000F
#define _ADCON1_ADON_MASK                        0x00008000
#define _ADCON1_ADON_LENGTH                      0x00000001

#define _ADCON1_FORM0_POSITION                   0x00000008
#define _ADCON1_FORM0_MASK                       0x00000100
#define _ADCON1_FORM0_LENGTH                     0x00000001

#define _ADCON1_FORM1_POSITION                   0x00000009
#define _ADCON1_FORM1_MASK                       0x00000200
#define _ADCON1_FORM1_LENGTH                     0x00000001

#define _ADCON1_FORM2_POSITION                   0x0000000A
#define _ADCON1_FORM2_MASK                       0x00000400
#define _ADCON1_FORM2_LENGTH                     0x00000001

#define _ADCON1_FORM3_POSITION                   0x0000000B
#define _ADCON1_FORM3_MASK                       0x00000800
#define _ADCON1_FORM3_LENGTH                     0x00000001

#define _ADCON2_ADHALT_POSITION                  0x00000000
#define _ADCON2_ADHALT_MASK                      0x00000001
#define _ADCON2_ADHALT_LENGTH                    0x00000001

#define _ADCON2_REFPUMP_POSITION                 0x00000001
#define _ADCON2_REFPUMP_MASK                     0x00000002
#define _ADCON2_REFPUMP_LENGTH                   0x00000001

#define _ADCON2_BUFINT_POSITION                  0x00000006
#define _ADCON2_BUFINT_MASK                      0x000000C0
#define _ADCON2_BUFINT_LENGTH                    0x00000002

#define _ADCON2_ADPWR_POSITION                   0x00000008
#define _ADCON2_ADPWR_MASK                       0x00000300
#define _ADCON2_ADPWR_LENGTH                     0x00000002

#define _ADCON2_BUFORG_POSITION                  0x0000000A
#define _ADCON2_BUFORG_MASK                      0x00000400
#define _ADCON2_BUFORG_LENGTH                    0x00000001

#define _ADCON2_NVCFG0_POSITION                  0x0000000C
#define _ADCON2_NVCFG0_MASK                      0x00001000
#define _ADCON2_NVCFG0_LENGTH                    0x00000001

#define _ADCON2_PVCFG_POSITION                   0x0000000E
#define _ADCON2_PVCFG_MASK                       0x0000C000
#define _ADCON2_PVCFG_LENGTH                     0x00000002

#define _ADCON2_BUFINT0_POSITION                 0x00000006
#define _ADCON2_BUFINT0_MASK                     0x00000040
#define _ADCON2_BUFINT0_LENGTH                   0x00000001

#define _ADCON2_BUFINT1_POSITION                 0x00000007
#define _ADCON2_BUFINT1_MASK                     0x00000080
#define _ADCON2_BUFINT1_LENGTH                   0x00000001

#define _ADCON2_ADPWR0_POSITION                  0x00000008
#define _ADCON2_ADPWR0_MASK                      0x00000100
#define _ADCON2_ADPWR0_LENGTH                    0x00000001

#define _ADCON2_ADPWR1_POSITION                  0x00000009
#define _ADCON2_ADPWR1_MASK                      0x00000200
#define _ADCON2_ADPWR1_LENGTH                    0x00000001

#define _ADCON2_NVCFG_POSITION                   0x0000000C
#define _ADCON2_NVCFG_MASK                       0x00001000
#define _ADCON2_NVCFG_LENGTH                     0x00000001

#define _ADCON2_PVCFG0_POSITION                  0x0000000E
#define _ADCON2_PVCFG0_MASK                      0x00004000
#define _ADCON2_PVCFG0_LENGTH                    0x00000001

