Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GC006.h
#define _LCDDATA1_S21C0_POSITION                 0x00000005
#define _LCDDATA1_S21C0_MASK                     0x00000020
#define _LCDDATA1_S21C0_LENGTH                   0x00000001

#define _LCDDATA1_S22C0_POSITION                 0x00000006
#define _LCDDATA1_S22C0_MASK                     0x00000040
#define _LCDDATA1_S22C0_LENGTH                   0x00000001

#define _LCDDATA1_S23C0_POSITION                 0x00000007
#define _LCDDATA1_S23C0_MASK                     0x00000080
#define _LCDDATA1_S23C0_LENGTH                   0x00000001

#define _LCDDATA1_S24C0_POSITION                 0x00000008
#define _LCDDATA1_S24C0_MASK                     0x00000100
#define _LCDDATA1_S24C0_LENGTH                   0x00000001

#define _LCDDATA1_S25C0_POSITION                 0x00000009
#define _LCDDATA1_S25C0_MASK                     0x00000200
#define _LCDDATA1_S25C0_LENGTH                   0x00000001

#define _LCDDATA1_S26C0_POSITION                 0x0000000A
#define _LCDDATA1_S26C0_MASK                     0x00000400
#define _LCDDATA1_S26C0_LENGTH                   0x00000001

#define _LCDDATA1_S27C0_POSITION                 0x0000000B
#define _LCDDATA1_S27C0_MASK                     0x00000800
#define _LCDDATA1_S27C0_LENGTH                   0x00000001

#define _LCDDATA1_S30C0_POSITION                 0x0000000E
#define _LCDDATA1_S30C0_MASK                     0x00004000
#define _LCDDATA1_S30C0_LENGTH                   0x00000001

#define _LCDDATA2_S47C0_POSITION                 0x0000000F
#define _LCDDATA2_S47C0_MASK                     0x00008000
#define _LCDDATA2_S47C0_LENGTH                   0x00000001

#define _LCDDATA3_S48C0_POSITION                 0x00000000
#define _LCDDATA3_S48C0_MASK                     0x00000001
#define _LCDDATA3_S48C0_LENGTH                   0x00000001

#define _LCDDATA3_S62C0_POSITION                 0x0000000E
#define _LCDDATA3_S62C0_MASK                     0x00004000
#define _LCDDATA3_S62C0_LENGTH                   0x00000001

#define _LCDDATA4_S0C1_POSITION                  0x00000000
#define _LCDDATA4_S0C1_MASK                      0x00000001
#define _LCDDATA4_S0C1_LENGTH                    0x00000001

#define _LCDDATA4_S1C1_POSITION                  0x00000001
#define _LCDDATA4_S1C1_MASK                      0x00000002
#define _LCDDATA4_S1C1_LENGTH                    0x00000001

#define _LCDDATA4_S2C1_POSITION                  0x00000002
#define _LCDDATA4_S2C1_MASK                      0x00000004
#define _LCDDATA4_S2C1_LENGTH                    0x00000001

#define _LCDDATA4_S3C1_POSITION                  0x00000003
#define _LCDDATA4_S3C1_MASK                      0x00000008
#define _LCDDATA4_S3C1_LENGTH                    0x00000001

#define _LCDDATA4_S4C1_POSITION                  0x00000004
#define _LCDDATA4_S4C1_MASK                      0x00000010
#define _LCDDATA4_S4C1_LENGTH                    0x00000001

#define _LCDDATA4_S5C1_POSITION                  0x00000005
#define _LCDDATA4_S5C1_MASK                      0x00000020
#define _LCDDATA4_S5C1_LENGTH                    0x00000001

#define _LCDDATA4_S6C1_POSITION                  0x00000006
#define _LCDDATA4_S6C1_MASK                      0x00000040
#define _LCDDATA4_S6C1_LENGTH                    0x00000001

#define _LCDDATA4_S7C1_POSITION                  0x00000007
#define _LCDDATA4_S7C1_MASK                      0x00000080
#define _LCDDATA4_S7C1_LENGTH                    0x00000001

#define _LCDDATA4_S8C1_POSITION                  0x00000008
#define _LCDDATA4_S8C1_MASK                      0x00000100
#define _LCDDATA4_S8C1_LENGTH                    0x00000001

#define _LCDDATA4_S9C1_POSITION                  0x00000009
#define _LCDDATA4_S9C1_MASK                      0x00000200
#define _LCDDATA4_S9C1_LENGTH                    0x00000001

#define _LCDDATA4_S10C1_POSITION                 0x0000000A
#define _LCDDATA4_S10C1_MASK                     0x00000400
#define _LCDDATA4_S10C1_LENGTH                   0x00000001

#define _LCDDATA4_S11C1_POSITION                 0x0000000B
#define _LCDDATA4_S11C1_MASK                     0x00000800
#define _LCDDATA4_S11C1_LENGTH                   0x00000001

#define _LCDDATA4_S12C1_POSITION                 0x0000000C
#define _LCDDATA4_S12C1_MASK                     0x00001000
#define _LCDDATA4_S12C1_LENGTH                   0x00000001

#define _LCDDATA4_S13C1_POSITION                 0x0000000D
#define _LCDDATA4_S13C1_MASK                     0x00002000
#define _LCDDATA4_S13C1_LENGTH                   0x00000001

#define _LCDDATA4_S14C1_POSITION                 0x0000000E
#define _LCDDATA4_S14C1_MASK                     0x00004000
#define _LCDDATA4_S14C1_LENGTH                   0x00000001

#define _LCDDATA4_S15C1_POSITION                 0x0000000F
#define _LCDDATA4_S15C1_MASK                     0x00008000
#define _LCDDATA4_S15C1_LENGTH                   0x00000001

#define _LCDDATA5_S16C1_POSITION                 0x00000000
#define _LCDDATA5_S16C1_MASK                     0x00000001
#define _LCDDATA5_S16C1_LENGTH                   0x00000001

#define _LCDDATA5_S17C1_POSITION                 0x00000001
#define _LCDDATA5_S17C1_MASK                     0x00000002
#define _LCDDATA5_S17C1_LENGTH                   0x00000001

#define _LCDDATA5_S18C1_POSITION                 0x00000002
#define _LCDDATA5_S18C1_MASK                     0x00000004
#define _LCDDATA5_S18C1_LENGTH                   0x00000001

#define _LCDDATA5_S19C1_POSITION                 0x00000003
#define _LCDDATA5_S19C1_MASK                     0x00000008
#define _LCDDATA5_S19C1_LENGTH                   0x00000001

#define _LCDDATA5_S20C1_POSITION                 0x00000004
#define _LCDDATA5_S20C1_MASK                     0x00000010
#define _LCDDATA5_S20C1_LENGTH                   0x00000001

#define _LCDDATA5_S21C1_POSITION                 0x00000005
#define _LCDDATA5_S21C1_MASK                     0x00000020
#define _LCDDATA5_S21C1_LENGTH                   0x00000001

#define _LCDDATA5_S22C1_POSITION                 0x00000006
#define _LCDDATA5_S22C1_MASK                     0x00000040
#define _LCDDATA5_S22C1_LENGTH                   0x00000001

